import random
a1 = ['Коллеги,', 'В то же время,', 'Однако,', 'Тем не менее,', 'Следовательно,', 'Соответсвенно,', 'Вместе с тем,', 'С другой стороны,']
a2 = ['парадигма цифровой экономики', 'контекст цифровой трансформации', 'диджитализация бизнес-процессов', 'прагматичный подход к цифровым платформам', 
        'совокупность сквозныз технологий', 'программа прорывных исследований', 'ускорение блокченй-транзакций', 'экспоненциальный рост Big Data']
a3 = ['открывает новые возможности для', 'выдвигает новые требования', 'несет в себе риски', 'расширяет горизонты', 'заставляет искать варианты', 
        'не оставляет шанса для', 'повышает вероятнсоть', 'обостряет проблему']
a4 = ['дальнейшего углубления', 'бюджетного финансирования', 'синергетического эффекта', 'компрометации конфиденциальности', 'универсальной коммодитизации',
        'несанкционированной кастомизации', 'нормативного регулирования', 'практического применения']
a5 = ['знаний и компетенций.', 'непроверенных гипотез.', 'волатильных активов.', 'опасных экспериментов.', 'государственных партнерств.', 
        'цифровых следов граждан.', 'нежелательных последствий.', 'внезапных открытий.']
print(random.choice(a1), random.choice(a2), random.choice(a3), random.choice(a4), random.choice(a5))