#Задание 1
clothes = 'Домашняя одежда'
print('У меня большой гардероб')
print('Утром лучше всего подходит ' + clothes)
print('Днем лучше всего подходит ' + clothes)
print('Вечером лучше всего подходит ' + clothes)
# Задание 2
quilt_width = 8
quilt_height = 12
#Кол-во квадратов для одеяла 8x12
print(f'Кличество квадратов для создания одеяла: {quilt_height*quilt_width}')
#Если одеяло 8x8
quilt_height = quilt_width
print(f'Кол-во квадратов для одеялв с равными сторонами: {quilt_width*quilt_height}')
#Площадь прямоугольника со сторонами 23,13
print(f'Площадь прямоугольника со сторонами 23,13: {23*13}')
