print("*** Одежда ***")
clothes = "домашняя одежда"
print("У меня большой гардероб")
print("Утром лучше всего подходит " + clothes)

clothes = "пальто"
print("Дней лучше всего подходит " + clothes)

clothes = "куртка"
print("Вечерром лучше всего подходит " + clothes)

clothes = "пижама"
print("Ночью лучше всего подходит " + clothes)

print("\n*** Еда ***")
meal = "панкейки"
print("На завтрак мои предпочтения в еде - " + meal)

meal = "котлеты"
print("На обед мои предпочтения в еде - " + meal)

meal = "картошка с мясом"
print("На ужин мои предпочтения в еде - " + meal)

print("\n*** Одеяло ***")
quilt_width = 8
quilt_length = 12
print("Количество квадратов для создния одеяла 8 квадратами в ширину и 12 квадратами в длину: " + str(quilt_width * quilt_length))

quilt_length = 8
print("Количество квадратов для создния одеяла 8 квадратами в ширину и 8 квадратами в длину: " + str(quilt_width * quilt_length))